Revit 2026 API

# DuctShape Enumeration

---

Enumerated type listing possible shapes for ducts.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DuctShape
```
```vb
Public Enumeration DuctShape
```
```cpp
public enum class DuctShape
```
```fsharp
type DuctShape
```

| Member name | Value | Description |
| --- | --- | --- |
| Oval | 2 | Oval duct shape. |
| Rectangular | 1 | Rectangular duct shape. |
| Round | 0 | Round duct shape. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace